kazkojima/bee3b/stm32/mcu/stm32f722/mcu.h
// Copyright (C) 2018 kaz Kojima
//
// This file is part of ef runtime library.  This library is free
// software; you can redistribute it and/or modify it under the
// terms of the GNU General Public License as published by the
// Free Software Foundation; either version 3, or (at your option)
// any later version.

// This library is distributed in the hope that it will be useful,
// but WITHOUT ANY WARRANTY; without even the implied warranty of
// MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
// GNU General Public License for more details.

// Under Section 7 of GPL version 3, you are granted additional
// permissions described in the EF Runtime Library Exception.

// You should have received a copy of the GNU General Public License and
// a copy of the EF Runtime Library Exception along with this program;
// see the files COPYING and EXCEPTION respectively.

/* Simple STM32F7xx definitions.  Not complete. */

/* Cotex-M7 system controll block definition. */

struct SCB
{
  volatile uint32_t CPUID;
  volatile uint32_t ICSR;
  volatile uint32_t VTOR;
  volatile uint32_t AIRCR;
  volatile uint32_t SCR;
  volatile uint32_t CCR;
  volatile uint8_t  SHP[12];
  volatile uint32_t SHCSR;
  volatile uint32_t CFSR;
  volatile uint32_t HFSR;
  volatile uint32_t DFSR;
  volatile uint32_t MMFAR;
  volatile uint32_t BFAR;
  volatile uint32_t AFSR;
  volatile uint32_t PFR[2];
  volatile uint32_t DFR;
  volatile uint32_t AFR;
  volatile uint32_t MMFR[4];
  volatile uint32_t ISAR[5];
  uint32_t dummy0[1];
  volatile uint32_t CLIDR;
  volatile uint32_t CTR;
  volatile uint32_t CCSIDR;
  volatile uint32_t CSSELR;
  volatile uint32_t CPACR;
  uint32_t dummy3[93];
  volatile uint32_t STIR;
  uint32_t dummy4[15];
  volatile uint32_t MVFR0;
  volatile uint32_t MVFR1;
  volatile uint32_t MVFR2;
  uint32_t dummy5[1];
  volatile uint32_t ICIALLU;
  uint32_t dummy6[1];
  volatile uint32_t ICIMVAU;
  volatile uint32_t DCIMVAC;
  volatile uint32_t DCISW;
  volatile uint32_t DCCMVAU;
  volatile uint32_t DCCMVAC;
  volatile uint32_t DCCSW;
  volatile uint32_t DCCIMVAC;
  volatile uint32_t DCCISW;
  uint32_t dummy7[6];
  volatile uint32_t ITCMCR;
  volatile uint32_t DTCMCR;
  volatile uint32_t AHBPCR;
  volatile uint32_t CACR;
  volatile uint32_t AHBSCR;
  uint32_t dummy8[1];
  volatile uint32_t ABFSR;
};

#define SCB_CCR_DC_MASK		(1 << 16)
#define SCB_CCR_IC_MASK		(1 << 17)

#define CCSIDR_SETS(x)		(((x) >> 13) & 0x7FFF)
#define CCSIDR_WAYS(x)		(((x) >> 3) & 0x3FF)
#define SBC_DCISW(s,w)		((((s) & 0x1ff) << 5)|(((w) & 0x3) << 30))

#define SCS_BASE	(0xE000E000)
#define SCB_BASE	(SCS_BASE +  0x0D00)
static struct SCB *const SCB = ((struct SCB *const) SCB_BASE);

struct FPU
{
  uint32_t dummy0[1];
  volatile uint32_t FPCCR;
  volatile uint32_t FPCAR;
  volatile uint32_t FPDSCR;
  volatile uint32_t MVFR0;
  volatile uint32_t MVFR1;
  volatile uint32_t MVFR2;
};

#define FPU_BASE	(SCS_BASE + 0x0F30)
static struct FPU *const FPU = ((struct FPU *const) FPU_BASE);

/* Some STM32F722 peripheral definitions.  */

#define PERIPH_BASE		0x40000000
#define APB1PERIPH_BASE  	PERIPH_BASE
#define APB2PERIPH_BASE		(PERIPH_BASE + 0x10000)
#define AHB1PERIPH_BASE		(PERIPH_BASE + 0x20000)
#define AHB2PERIPH_BASE		(PERIPH_BASE + 0x10000000)
#define AHB3PERIPH_BASE		(PERIPH_BASE + 0x60000000)

/* RCC */
struct RCC {
  volatile uint32_t CR;
  volatile uint32_t PLLCFGR;
  volatile uint32_t CFGR;
  volatile uint32_t CIR;
  volatile uint32_t AHB1RSTR;
  volatile uint32_t AHB2RSTR;
  volatile uint32_t AHB3RSTR;
  uint32_t dummy0[1];
  volatile uint32_t APB1RSTR;
  volatile uint32_t APB2RSTR;
  uint32_t dummy1[2];
  volatile uint32_t AHB1ENR;
  volatile uint32_t AHB2ENR;
  volatile uint32_t AHB3ENR;
  uint32_t dummy2[1];
  volatile uint32_t APB1ENR;
  volatile uint32_t APB2ENR;
  uint32_t dummy3[2];
  volatile uint32_t AHB1LPENR;
  volatile uint32_t AHB2LPENR;
  volatile uint32_t AHB3LPENR;
  uint32_t dummy4[1];
  volatile uint32_t APB1LPENR;
  volatile uint32_t APB2LPENR;
  uint32_t dummy5[2];
  volatile uint32_t BDCR;
  volatile uint32_t CSR;
  uint32_t dummy6[2];
  volatile uint32_t SSCGR;
  volatile uint32_t PLLI2SCFGR;
  volatile uint32_t PLLSAICFGR;
  volatile uint32_t DCKCFGR1;
  volatile uint32_t DCKCFGR2;
};

#define RCC_CR_HSION		(1 << 0)
#define RCC_CR_HSIRDY		(1 << 1)
#define RCC_CR_HSEON		(1 << 16)
#define RCC_CR_HSERDY		(1 << 17)
#define RCC_CR_CSSON		(1 << 19)
#define RCC_CR_PLLON		(1 << 24)
#define RCC_CR_PLLRDY		(1 << 25)
#define RCC_CR_PLLI2SON		(1 << 26)
#define RCC_CR_PLLI2SRDY	(1 << 27)
#define RCC_CR_PLLSAION		(1 << 28)
#define RCC_CR_PLLSAIRDY	(1 << 29)

#define RCC_PLLCFGR_PLLM_SHIFT	0
#define RCC_PLLCFGR_PLLN_SHIFT	6
#define RCC_PLLCFGR_PLLP_SHIFT	16
#define RCC_PLLCFGR_PLLSRC_HSE	(1 << 22)
#define RCC_PLLCFGR_PLLQ_SHIFT	24
#define RCC_PLLCFGR_PLLR_SHIFT	28

#define RCC_CFGR_SW_SHIFT	0
#define RCC_CFGR_SW_PLL		2
#define RCC_CFGR_SWS_SHIFT	2
#define RCC_CFGR_SWS_HSI	0
#define RCC_CFGR_HPRE_SHIFT	4
#define RCC_CFGR_PPRE1_SHIFT	10
#define RCC_CFGR_PPRE1_DIV4	5
#define RCC_CFGR_PPRE2_SHIFT	13
#define RCC_CFGR_PPRE2_DIV2	4
#define RCC_CFGR_RTCPRE_SHIFT	16
#define RCC_CFGR_MCO1_SHIFT	21
#define RCC_CFGR_I2SSRC_SHIFT	23
#define RCC_CFGR_MCO1PRE_SHIFT	24
#define RCC_CFGR_MCO2PRE_SHIFT	27
#define RCC_CFGR_MCO2_SHIFT	30

#define RCC_AHB1RSTR_GPIOARST	(1 << 0)
#define RCC_AHB1RSTR_GPIOBRST	(1 << 1)
#define RCC_AHB1RSTR_GPIOCRST	(1 << 2)
#define RCC_AHB1RSTR_GPIODRST	(1 << 3)
#define RCC_AHB1RSTR_GPIOERST	(1 << 4)
#define RCC_AHB1RSTR_GPIOFRST	(1 << 5)
#define RCC_AHB1RSTR_GPIOGRST	(1 << 6)
#define RCC_AHB1RSTR_GPIOHRST	(1 << 7)
#define RCC_AHB1RSTR_GPIOIRST	(1 << 8)
#define RCC_AHB1RSTR_GPIOJRST	(1 << 9)
#define RCC_AHB1RSTR_GPIOKRST	(1 << 10)
#define RCC_AHB1RSTR_CRCRST	(1 << 12)
#define RCC_AHB1RSTR_DMA1RST	(1 << 21)
#define RCC_AHB1RSTR_DMA2RST	(1 << 22)
#define RCC_AHB1RSTR_DMA2DRST	(1 << 23)
#define RCC_AHB1RSTR_ETHMACRST	(1 << 25)
#define RCC_AHB1RSTR_OTGHSRST	(1 << 29)

#define RCC_AHB2RSTR_DCMIRST	(1 << 0)
#define RCC_AHB2RSTR_CRYPRST	(1 << 4)
#define RCC_AHB2RSTR_HASHRST	(1 << 5)
#define RCC_AHB2RSTR_RNGRST	(1 << 6)
#define RCC_AHB2RSTR_OTGFSRST	(1 << 7)

#define RCC_AHB3RSTR_FMCRST	(1 << 0)
#define RCC_AHB3RSTR_QSPIRST	(1 << 1)

#define RCC_APB1RSTR_TIM2RST	(1 << 0)
#define RCC_APB1RSTR_TIM3RST	(1 << 1)
#define RCC_APB1RSTR_TIM4RST	(1 << 2)
#define RCC_APB1RSTR_TIM5RST	(1 << 3)
#define RCC_APB1RSTR_TIM6RST	(1 << 4)
#define RCC_APB1RSTR_TIM7RST	(1 << 5)
#define RCC_APB1RSTR_TIM12RST	(1 << 6)
#define RCC_APB1RSTR_TIM13RST	(1 << 7)
#define RCC_APB1RSTR_TIM14RST	(1 << 8)
#define RCC_APB1RSTR_LPTIM1RST	(1 << 9)
#define RCC_APB1RSTR_WWDGRST	(1 << 11)
#define RCC_APB1RSTR_SPI2RST	(1 << 14)
#define RCC_APB1RSTR_SPI3RST	(1 << 15)
#define RCC_APB1RSTR_SPDIFRXRST	(1 << 16)
#define RCC_APB1RSTR_USART2RST	(1 << 17)
#define RCC_APB1RSTR_USART3RST	(1 << 18)
#define RCC_APB1RSTR_UART4RST	(1 << 19)
#define RCC_APB1RSTR_UART5RST	(1 << 20)
#define RCC_APB1RSTR_I2C1RST	(1 << 21)
#define RCC_APB1RSTR_I2C2RST	(1 << 22)
#define RCC_APB1RSTR_I2C3RST	(1 << 23)
#define RCC_APB1RSTR_I2C4RST	(1 << 24)
#define RCC_APB1RSTR_CAN1RST	(1 << 25)
#define RCC_APB1RSTR_CAN2RST	(1 << 26)
#define RCC_APB1RSTR_CECRST	(1 << 27)
#define RCC_APB1RSTR_PWRRST	(1 << 28)
#define RCC_APB1RSTR_DACRST	(1 << 29)
#define RCC_APB1RSTR_UART7RST	(1 << 30)
#define RCC_APB1RSTR_UART85RST	(1 << 31)

#define RCC_APB2RSTR_TIM1RST	(1 << 0)
#define RCC_APB2RSTR_TIM8RST	(1 << 1)
#define RCC_APB2RSTR_USART1RST	(1 << 4)
#define RCC_APB2RSTR_USART6RST	(1 << 5)
#define RCC_APB2RSTR_ADCRST	(1 << 8)
#define RCC_APB2RSTR_SDMMC1RST	(1 << 11)
#define RCC_APB2RSTR_SPI1RST	(1 << 12)
#define RCC_APB2RSTR_SPI4RST	(1 << 13)
#define RCC_APB2RSTR_SYSCFGRST	(1 << 14)
#define RCC_APB2RSTR_TIM9RST	(1 << 16)
#define RCC_APB2RSTR_TIM10RST	(1 << 17)
#define RCC_APB2RSTR_TIM11RST	(1 << 18)
#define RCC_APB2RSTR_SPI5RST	(1 << 20)
#define RCC_APB2RSTR_SPI6RST	(1 << 21)
#define RCC_APB2RSTR_SAI1RST	(1 << 22)
#define RCC_APB2RSTR_SAI2RST	(1 << 23)
#define RCC_APB2RSTR_LTDCRST	(1 << 26)

#define RCC_AHB1ENR_GPIOAEN	(1 << 0)
#define RCC_AHB1ENR_GPIOBEN	(1 << 1)
#define RCC_AHB1ENR_GPIOCEN	(1 << 2)
#define RCC_AHB1ENR_GPIODEN	(1 << 3)
#define RCC_AHB1ENR_GPIOEEN	(1 << 4)
#define RCC_AHB1ENR_GPIOFEN	(1 << 5)
#define RCC_AHB1ENR_GPIOGEN	(1 << 6)
#define RCC_AHB1ENR_GPIOHEN	(1 << 7)
#define RCC_AHB1ENR_GPIOIEN	(1 << 8)
#define RCC_AHB1ENR_GPIOJEN	(1 << 9)
#define RCC_AHB1ENR_GPIOKEN	(1 << 10)
#define RCC_AHB1ENR_CRCEN	(1 << 12)
#define RCC_AHB1ENR_BKPSRAMEN	(1 << 18)
#define RCC_AHB1ENR_DTCMRAMEN	(1 << 20)
#define RCC_AHB1ENR_DMA1EN	(1 << 21)
#define RCC_AHB1ENR_DMA2EN	(1 << 22)
#define RCC_AHB1ENR_DMA2DEN	(1 << 23)
#define RCC_AHB1ENR_ETHMACEN	(1 << 25)
#define RCC_AHB1ENR_ETHMACTXEN	(1 << 26)
#define RCC_AHB1ENR_ETHMACRXEN	(1 << 27)
#define RCC_AHB1ENR_ETHMACPTPEN	(1 << 28)
#define RCC_AHB1ENR_OTGHSEN	(1 << 29)
#define RCC_AHB1ENR_OTGHSULPIEN	(1 << 30)

#define RCC_AHB2ENR_DCMIEN	(1 << 0)
#define RCC_AHB2ENR_CRYPEN	(1 << 4)
#define RCC_AHB2ENR_HASHEN	(1 << 5)
#define RCC_AHB2ENR_RNGEN	(1 << 6)
#define RCC_AHB2ENR_OTGFSEN	(1 << 7)

