kazkojima/bee3b/stm32/mcu/stm32f722/mcu.h
#define RCC_AHB3ENR_FMCEN	(1 << 0)
#define RCC_AHB3ENR_QSPIEN	(1 << 1)

#define RCC_APB1ENR_TIM2EN	(1 << 0)
#define RCC_APB1ENR_TIM3EN	(1 << 1)
#define RCC_APB1ENR_TIM4EN	(1 << 2)
#define RCC_APB1ENR_TIM5EN	(1 << 3)
#define RCC_APB1ENR_TIM6EN	(1 << 4)
#define RCC_APB1ENR_TIM7EN	(1 << 5)
#define RCC_APB1ENR_TIM12EN	(1 << 6)
#define RCC_APB1ENR_TIM13EN	(1 << 7)
#define RCC_APB1ENR_TIM14EN	(1 << 8)
#define RCC_APB1ENR_LPTIM1EN	(1 << 9)
#define RCC_APB1ENR_WWDGEN	(1 << 11)
#define RCC_APB1ENR_SPI2EN	(1 << 14)
#define RCC_APB1ENR_SPI3EN	(1 << 15)
#define RCC_APB1ENR_SPDIFRXEN	(1 << 16)
#define RCC_APB1ENR_USART2EN	(1 << 17)
#define RCC_APB1ENR_USART3EN	(1 << 18)
#define RCC_APB1ENR_UART4EN	(1 << 19)
#define RCC_APB1ENR_UART5EN	(1 << 20)
#define RCC_APB1ENR_I2C1EN	(1 << 21)
#define RCC_APB1ENR_I2C2EN	(1 << 22)
#define RCC_APB1ENR_I2C3EN	(1 << 23)
#define RCC_APB1ENR_I2C4EN	(1 << 24)
#define RCC_APB1ENR_CAN1EN	(1 << 25)
#define RCC_APB1ENR_CAN2EN	(1 << 26)
#define RCC_APB1ENR_CECEN	(1 << 27)
#define RCC_APB1ENR_PWREN	(1 << 28)
#define RCC_APB1ENR_DACEN	(1 << 29)
#define RCC_APB1ENR_UART7EN	(1 << 30)
#define RCC_APB1ENR_UART85EN	(1 << 31)

#define RCC_APB2ENR_TIM1EN	(1 << 0)
#define RCC_APB2ENR_TIM8EN	(1 << 1)
#define RCC_APB2ENR_USART1EN	(1 << 4)
#define RCC_APB2ENR_USART6EN	(1 << 5)
#define RCC_APB2ENR_ADC1EN	(1 << 8)
#define RCC_APB2ENR_ADC2EN	(1 << 9)
#define RCC_APB2ENR_ADC3EN	(1 << 10)
#define RCC_APB2ENR_SDMMC1EN	(1 << 11)
#define RCC_APB2ENR_SPI1EN	(1 << 12)
#define RCC_APB2ENR_SPI4EN	(1 << 13)
#define RCC_APB2ENR_SYSCFGEN	(1 << 14)
#define RCC_APB2ENR_TIM9EN	(1 << 16)
#define RCC_APB2ENR_TIM10EN	(1 << 17)
#define RCC_APB2ENR_TIM11EN	(1 << 18)
#define RCC_APB2ENR_SPI5EN	(1 << 20)
#define RCC_APB2ENR_SPI6EN	(1 << 21)
#define RCC_APB2ENR_SAI1EN	(1 << 22)
#define RCC_APB2ENR_SAI2EN	(1 << 23)
#define RCC_APB2ENR_LTDCEN	(1 << 26)

#define RCC_BDCR_LSEON		(1 << 0)
#define RCC_BDCR_LSERDY		(1 << 1)
#define RCC_BDCR_LSEBYP		(1 << 2)
#define RCC_BDCR_LSEDRV_SHIFT	3
#define RCC_BDCR_RTCSEL_SHIFT	8
#define RCC_BDCR_RTCEN		(1 << 15)
#define RCC_BDCR_BDRST		(1 << 16)

#define RCC_CSR_LSION		(1 << 0)
#define RCC_CSR_LSIRDY		(1 << 1)
#define RCC_CSR_RMVF		(1 << 24)
#define RCC_CSR_BORRSTF		(1 << 25)
#define RCC_CSR_PINRSTF		(1 << 26)
#define RCC_CSR_PORRSTF		(1 << 27)
#define RCC_CSR_SFTRSTF		(1 << 28)
#define RCC_CSR_IWDGRSTF	(1 << 29)
#define RCC_CSR_WWDGRSTF	(1 << 30)
#define RCC_CSR_LPWRRSTF	(1 << 31)

#define RCC_SSCGR_MODPER_SHIFT	0
#define RCC_SSCGR_INCSTEP_SHIFT	13
#define RCC_SSGCR_SPREDSEL	(1 << 30)
#define RCC_SSGCR_SSCGEN	(1 << 31)

// PLL for I2S and SAI
#define RCC_PLLXCFGR_PLLN_SHIFT	6
#define RCC_PLLXCFGR_PLLP_SHIFT	16
#define RCC_PLLXCFGR_PLLQ_SHIFT	24
#define RCC_PLLXCFGR_PLLR_SHIFT	28

#define RCC_DCKCFGR1_PLLI2SDIVQ_SHIFT	0
#define RCC_DCKCFGR1_PLLSAIDIVQ_SHIFT	8
#define RCC_DCKCFGR1_PLLSAIDIVR_SHIFT	16
#define RCC_DCKCFGR1_PLLSAI1SEL_SHIFT	20
#define RCC_DCKCFGR1_PLLSAI2SEL_SHIFT	22
#define RCC_DCKCFGR1_TIMPRE		(1 << 24)

#define RCC_DCKCFGR2_UART1SEL_SHIFT	0
#define RCC_DCKCFGR2_UART2SEL_SHIFT	2
#define RCC_DCKCFGR2_UART3SEL_SHIFT	4
#define RCC_DCKCFGR2_UART4SEL_SHIFT	6
#define RCC_DCKCFGR2_UART5SEL_SHIFT	8
#define RCC_DCKCFGR2_UART6SEL_SHIFT	10
#define RCC_DCKCFGR2_UART7SEL_SHIFT	12
#define RCC_DCKCFGR2_UART8SEL_SHIFT	14
#define RCC_DCKCFGR2_I2C1SEL_SHIFT	16
#define RCC_DCKCFGR2_I2C2SEL_SHIFT	18
#define RCC_DCKCFGR2_I2C3SEL_SHIFT	20
#define RCC_DCKCFGR2_I2C4SEL_SHIFT	22
#define RCC_DCKCFGR2_LPTIM1SEL_SHIFT	24
#define RCC_DCKCFGR2_CECSEL		(1 << 26)
#define RCC_DCKCFGR2_CK48MSEL		(1 << 27)
#define RCC_DCKCFGR2_SDMMC1SEL		(1 << 28)

/* SYSCFG */
struct SYSCFG {
  volatile uint32_t MEMRMP;
  volatile uint32_t PMC;
  volatile uint32_t EXTICR[4];
  uint32_t dummy0[2];
  volatile uint32_t CMPCR;
};

#define SYSCFG_MEMRMP_MEM_BOOT 0x1

/* EXTI */
struct EXTI {
  volatile uint32_t IMR;
  volatile uint32_t EMR;
  volatile uint32_t RTSR;
  volatile uint32_t FTSR;
  volatile uint32_t SWIER;
  volatile uint32_t PR;
};

/* POWER */
struct PWR {
  volatile uint32_t CR1;
  volatile uint32_t CSR1;
  volatile uint32_t CR2;
  volatile uint32_t CSR2;
};

#define PWR_CR1_CSBF		(1 << 3)
#define PWR_CR1_DBP		(1 << 8)
#define PWR_CR1_VOS_SHIFT	14
#define PWR_CR1_ODEN		(1 << 16)
#define PWR_CR1_ODSWEN		(1 << 17)

#define PWR_CSR1_VOSRDY		(1 << 14)
#define PWR_CSR1_ODRDY		(1 << 16)
#define PWR_CSR1_ODSWRDY	(1 << 17)

/* FLASH */
struct FLASH {
  volatile uint32_t ACR;
  volatile uint32_t KEYR;
  volatile uint32_t OPTKEYR;
  volatile uint32_t SR;
  volatile uint32_t CR;
  volatile uint32_t AR;
  volatile uint32_t RESERVED;
  volatile uint32_t OBR;
  volatile uint32_t WRPR;
};

#define FLASH_ACR_LATENCY_7WS	7
#define FLASH_ACR_PRFTEN	(1 << 8)
#define FLASH_ACR_ARTEN		(1 << 9)
#define FLASH_ACR_ARTRST	(1 << 11)

/* GPIO */
struct GPIO {
  volatile uint32_t MODER;
  volatile uint32_t OTYPER;
  volatile uint32_t OSPEEDR;
  volatile uint32_t PUPDR;
  volatile uint32_t IDR;
  volatile uint32_t ODR;
  volatile uint32_t BSRR;
  volatile uint32_t LCKR;
  volatile uint32_t AFR[2];
};

/* Timer */
struct TIM
{
  volatile uint32_t CR1;
  volatile uint32_t CR2;
  volatile uint32_t SMCR;
  volatile uint32_t DIER;
  volatile uint32_t SR;
  volatile uint32_t EGR;
  volatile uint32_t CCMR1;
  volatile uint32_t CCMR2;
  volatile uint32_t CCER;
  volatile uint32_t CNT;
  volatile uint32_t PSC;
  volatile uint32_t ARR;
  volatile uint32_t RCR;
  volatile uint32_t CCR1;
  volatile uint32_t CCR2;
  volatile uint32_t CCR3;
  volatile uint32_t CCR4;
  volatile uint32_t BDTR;
  volatile uint32_t DCR;
  volatile uint32_t DMAR;
  uint32_t dummy0[1];
  volatile uint32_t CCMR3;
  volatile uint32_t CCMR5;
  volatile uint32_t CCMR6;
};

/* USART */
struct USART
{
  volatile uint32_t CR1;
  volatile uint32_t CR2;
  volatile uint32_t CR3;
  volatile uint32_t BRR;
  volatile uint32_t GTPR;
  volatile uint32_t RTOR;
  volatile uint32_t RQR;
  volatile uint32_t ISR;
  volatile uint32_t ICR;
  volatile uint32_t RDR;
  volatile uint32_t TDR;
};

/* bxCAN */
struct TXMB
{
  volatile uint32_t TIR;
  volatile uint32_t TDTR;
  volatile uint32_t TDLR;
  volatile uint32_t TDHR;
};

struct RXMB
{
  volatile uint32_t RIR;
  volatile uint32_t RDTR;
  volatile uint32_t RDLR;
  volatile uint32_t RDHR;
};

struct FILT
{
  volatile uint32_t FR1;
  volatile uint32_t FR2;
};

struct CAN
{
  volatile uint32_t MCR;
  volatile uint32_t MSR;
  volatile uint32_t TSR;
  volatile uint32_t RF0R;
  volatile uint32_t RF1R;
  volatile uint32_t IER;
  volatile uint32_t ESR;
  volatile uint32_t BTR;
  uint32_t dummy0[88];
  struct TXMB TXMB[3];
  struct RXMB RXMB[2];
  uint32_t dummy1[12];
  volatile uint32_t FMR;
  volatile uint32_t FM1R;
  uint32_t dummy2;
  volatile uint32_t FS1R;
  uint32_t dummy3;
  volatile uint32_t FFA1R;
  uint32_t dummy4;
  volatile uint32_t FA1R;
  uint32_t dummy5[8];
  struct FILT BANK[28];
};

/* SPI/I2S */
struct SPI
{
  volatile uint32_t CR1;
  volatile uint32_t CR2;
  volatile uint32_t SR;
  volatile uint32_t DR;
  volatile uint32_t CRCPR;
  volatile uint32_t RXCRCR;
  volatile uint32_t TXCRCR;
  volatile uint32_t I2SCFGR;
  volatile uint32_t I2SPR;
};

/* I2C */

