kazkojima/bee3b/stm32/mcu/stm32f722/mcu.h
struct I2C
{
  volatile uint32_t CR1;
  volatile uint32_t CR2;
  volatile uint32_t OAR1;
  volatile uint32_t OAR2;
  volatile uint32_t DR;
  volatile uint32_t SR1;
  volatile uint32_t SR2;
  volatile uint32_t CCR;
  volatile uint32_t TRISE;
  volatile uint32_t FLTR;
};

/* ADC */

struct ADC
{
  volatile uint32_t SR;
  volatile uint32_t CR1;
  volatile uint32_t CR2;
  volatile uint32_t SMPR1;
  volatile uint32_t SMPR2;
  volatile uint32_t JOFR1;
  volatile uint32_t JOFR2;
  volatile uint32_t JOFR3;
  volatile uint32_t JOFR4;
  volatile uint32_t HTR;
  volatile uint32_t LTR;
  volatile uint32_t SQR1;
  volatile uint32_t SQR2;
  volatile uint32_t SQR3;
  volatile uint32_t JSQR;
  volatile uint32_t JDR1;
  volatile uint32_t JDR2;
  volatile uint32_t JDR3;
  volatile uint32_t JDR4;
  volatile uint32_t DR;
};

/* common ADC registers */

struct ADCC
{
  volatile uint32_t CSR;
  volatile uint32_t CCR;
  volatile uint32_t CDR;
};

#if 0
/* ethernet MAC */

struct ETH
{
  volatile uint32_t MACCR;
  volatile uint32_t MACFFR;
  volatile uint32_t MACHTHR;
  volatile uint32_t MACHTLR;
  volatile uint32_t MACMIIAR;
  volatile uint32_t MACMIIDR;
  volatile uint32_t MACFCR;
  volatile uint32_t MACVLANTR;
  uint32_t dummy0[2];
  volatile uint32_t MACRWUFFR;
  volatile uint32_t MACPMTCSR;
  uint32_t dummy1[2];
  volatile uint32_t MACSR;
  volatile uint32_t MACIMR;
  volatile uint32_t MACA0HR;
  volatile uint32_t MACA0LR;
  volatile uint32_t MACA1HR;
  volatile uint32_t MACA1LR;
  volatile uint32_t MACA2HR;
  volatile uint32_t MACA2LR;
  volatile uint32_t MACA3HR;
  volatile uint32_t MACA3LR;
  uint32_t dummy2[40];
  volatile uint32_t MMCCR;
  volatile uint32_t MMCRIR;
  volatile uint32_t MMCTIR;
  volatile uint32_t MMCRIMR;
  volatile uint32_t MMCTIMR;
  uint32_t dummy3[14];
  volatile uint32_t MMCTGFSCCR;
  volatile uint32_t MMCTGFMSCCR;
  uint32_t dummy4[5];
  volatile uint32_t MMCTGFCR;
  uint32_t dummy5[10];
  volatile uint32_t MMCRFCECR;
  volatile uint32_t MMCRFAECR;
  uint32_t dummy6[10];
  volatile uint32_t MMCRGUFCR;
  uint32_t dummy7[334];
  volatile uint32_t PTPTSCR;
  volatile uint32_t PTPSSIR;
  volatile uint32_t PTPTSHR;
  volatile uint32_t PTPTSLR;
  volatile uint32_t PTPTSHUR;
  volatile uint32_t PTPTSLUR;
  volatile uint32_t PTPTSAR;
  volatile uint32_t PTPTTHR;
  volatile uint32_t PTPTTLR;
  volatile uint32_t dummy8;
  volatile uint32_t PTPTSSR;
  uint32_t dummy9[565];
  volatile uint32_t DMABMR;
  volatile uint32_t DMATPDR;
  volatile uint32_t DMARPDR;
  volatile uint32_t DMARDLAR;
  volatile uint32_t DMATDLAR;
  volatile uint32_t DMASR;
  volatile uint32_t DMAOMR;
  volatile uint32_t DMAIER;
  volatile uint32_t DMAMFBOCR;
  volatile uint32_t DMARSWTR;
  uint32_t dummy10[8];
  volatile uint32_t DMACHTDR;
  volatile uint32_t DMACHRDR;
  volatile uint32_t DMACHTBAR;
  volatile uint32_t DMACHRBAR;
};
#endif

/* DMA */

struct DMA
{
  volatile uint32_t LISR;
  volatile uint32_t HISR;
  volatile uint32_t LIFCR;
  volatile uint32_t HIFCR;
};

#define DMA_TCIF3		(1 << 27)
#define DMA_HTIF3		(1 << 26)
#define DMA_TEIF3		(1 << 25)
#define DMA_DMEIF3		(1 << 24)
#define DMA_FEIF3		(1 << 22)
#define DMA_TCIF2		(1 << 21)
#define DMA_HTIF2		(1 << 20)
#define DMA_TEIF2		(1 << 19)
#define DMA_DMEIF2		(1 << 18)
#define DMA_FEIF2		(1 << 16)
#define DMA_TCIF1		(1 << 11)
#define DMA_HTIF1		(1 << 10)
#define DMA_TEIF1		(1 << 9)
#define DMA_DMEIF1		(1 << 8)
#define DMA_FEIF1		(1 << 6)
#define DMA_TCIF0		(1 << 5)
#define DMA_HTIF0		(1 << 4)
#define DMA_TEIF0		(1 << 3)
#define DMA_DMEIF0		(1 << 2)
#define DMA_FEIF0		(1 << 0)

#define DMA_TCIF7		(1 << 27)
#define DMA_HTIF7		(1 << 26)
#define DMA_TEIF7		(1 << 25)
#define DMA_DMEIF7		(1 << 24)
#define DMA_FEIF7		(1 << 22)
#define DMA_TCIF6		(1 << 21)
#define DMA_HTIF6		(1 << 20)
#define DMA_TEIF6		(1 << 19)
#define DMA_DMEIF6		(1 << 18)
#define DMA_FEIF6		(1 << 16)
#define DMA_TCIF5		(1 << 11)
#define DMA_HTIF5		(1 << 10)
#define DMA_TEIF5		(1 << 9)
#define DMA_DMEIF5		(1 << 8)
#define DMA_FEIF5		(1 << 6)
#define DMA_TCIF4		(1 << 5)
#define DMA_HTIF4		(1 << 4)
#define DMA_TEIF4		(1 << 3)
#define DMA_DMEIF4		(1 << 2)
#define DMA_FEIF4		(1 << 0)

/* DMA stream */
struct DMA_Stream
{
  volatile uint32_t CR;
  volatile uint32_t NDTR;
  volatile uint32_t PAR;
  volatile uint32_t M0AR;
  volatile uint32_t M1AR;
  volatile uint32_t FCR;
};

#define DMA_SxCR_CHSEL_shift	25
#define DMA_SxCR_MBURST_shift	23
#define DMA_SxCR_PBURST_shift	21
#define DMA_SxCR_BURST_SINGLE	0
#define DMA_SxCR_BURST_INCR4	1
#define DMA_SxCR_BURST_INCR8	2
#define DMA_SxCR_BURST_INCR16	3
#define DMA_SxCR_CT		(1 << 19)
#define DMA_SxCR_DBM		(1 << 18)
#define DMA_SxCR_PL_shift	16
#define DMA_SxCR_PL_LOW		0
#define DMA_SxCR_PL_MEDIUM	1
#define DMA_SxCR_PL_HIGH	2
#define DMA_SxCR_PL_VHIGH	3
#define DMA_SxCR_PINCOS		(1 << 15)
#define DMA_SxCR_MSIZE_shift	13
#define DMA_SxCR_PSIZE_shift	11
#define DMA_SxCR_SIZE_BYTE	0
#define DMA_SxCR_SIZE_HALF	1
#define DMA_SxCR_SIZE_WORD	2
#define DMA_SxCR_MINC		(1 << 10)
#define DMA_SxCR_PINC		(1 << 9)
#define DMA_SxCR_CIRC		(1 << 8)
#define DMA_SxCR_DIR_shift	6
#define DMA_SxCR_DIR_P2M	0
#define DMA_SxCR_DIR_M2P	1
#define DMA_SxCR_DIR_M2M	2
#define DMA_SxCR_PFCTRL		(1 << 5)
#define DMA_SxCR_TCIE		(1 << 4)
#define DMA_SxCR_HTIE		(1 << 3)
#define DMA_SxCR_TEIE		(1 << 2)
#define DMA_SxCR_DMEIE		(1 << 1)
#define DMA_SxCR_EN		(1 << 0)

#define DMA_SxFCR_FEIE		(1 << 7)
#define DMA_SxFCR_FS_shift	3
#define DMA_SxFCR_FS_1BY4	0
#define DMA_SxFCR_FS_1BY2	1
#define DMA_SxFCR_FS_3BY4	2
#define DMA_SxFCR_FS_ALMOST	3
#define DMA_SxFCR_FS_ENMPT	4
#define DMA_SxFCR_FS_FULL	5
#define DMA_SxFCR_DMDIS		(1 << 2)
#define DMA_SxFCR_FTH_shift	0
#define DMA_SxFCR_FTH_1BY4	0
#define DMA_SxFCR_FTH_1BY2	1
#define DMA_SxFCR_FTH_3BY4	2
#define DMA_SxFCR_FTH_FULL	3

/* Physical addresses */
#define RCC_BASE		(AHB1PERIPH_BASE + 0x3800)
#define SYSCFG_BASE		(APB2PERIPH_BASE + 0x3800)
#define EXTI_BASE		(APB2PERIPH_BASE + 0x3C00)
#define PWR_BASE		(APB1PERIPH_BASE + 0x7000)
#define FLASH_R_BASE		(AHB1PERIPH_BASE + 0x3C00)
#define GPIOA_BASE		(AHB1PERIPH_BASE + 0x0000)
#define GPIOB_BASE		(AHB1PERIPH_BASE + 0x0400)
#define GPIOC_BASE		(AHB1PERIPH_BASE + 0x0800)
#define GPIOD_BASE		(AHB1PERIPH_BASE + 0x0C00)
#define GPIOE_BASE		(AHB1PERIPH_BASE + 0x1000)
#define GPIOF_BASE		(AHB1PERIPH_BASE + 0x1400)
#define GPIOG_BASE		(AHB1PERIPH_BASE + 0x1800)
#define GPIOH_BASE		(AHB1PERIPH_BASE + 0x1C00)
#define GPIOI_BASE		(AHB1PERIPH_BASE + 0x2000)
#define GPIOJ_BASE		(AHB1PERIPH_BASE + 0x2400)
#define GPIOK_BASE		(AHB1PERIPH_BASE + 0x2800)
#define TIM2_BASE		(APB1PERIPH_BASE + 0x0000)
#define TIM3_BASE		(APB1PERIPH_BASE + 0x0400)
#define TIM4_BASE		(APB1PERIPH_BASE + 0x0800)
#define TIM5_BASE		(APB1PERIPH_BASE + 0x0C00)
#define TIM6_BASE		(APB1PERIPH_BASE + 0x1000)
#define TIM7_BASE		(APB1PERIPH_BASE + 0x1400)
#define USART1_BASE		(APB2PERIPH_BASE + 0x1000)
#define USART2_BASE		(APB1PERIPH_BASE + 0x4400)
#define USART3_BASE		(APB1PERIPH_BASE + 0x4800)
#define UART4_BASE		(APB1PERIPH_BASE + 0x4C00)
#define UART5_BASE		(APB1PERIPH_BASE + 0x5000)
#define USART6_BASE		(APB2PERIPH_BASE + 0x1400)
#define CAN1_BASE		(APB1PERIPH_BASE + 0x6400)
#define CAN2_BASE		(APB1PERIPH_BASE + 0x6800)
#define SPI1_BASE		(APB2PERIPH_BASE + 0x3000)
#define SPI2_BASE		(APB1PERIPH_BASE + 0x3800)
#define SPI3_BASE		(APB1PERIPH_BASE + 0x3C00)
#define I2C1_BASE		(APB1PERIPH_BASE + 0x5400)
#define I2C2_BASE		(APB1PERIPH_BASE + 0x5800)
#define I2C3_BASE		(APB1PERIPH_BASE + 0x5C00)
#define ADC1_BASE		(APB2PERIPH_BASE + 0x2000)
#define ADC2_BASE		(APB2PERIPH_BASE + 0x2100)
#define ADC3_BASE		(APB2PERIPH_BASE + 0x2200)
#define ADCC_BASE		(APB2PERIPH_BASE + 0x2300)
#define DMA1_BASE		(AHB1PERIPH_BASE + 0x6000)
#define DMA2_BASE		(AHB1PERIPH_BASE + 0x6400)
#if 0
#define ETH_BASE		(AHB1PERIPH_BASE + 0x8000)
#define ETH_MAC_BASE		(ETH_BASE)
#define ETH_MMC_BASE		(ETH_BASE + 0x0100U)
#define ETH_PTP_BASE		(ETH_BASE + 0x0700U)
#define ETH_DMA_BASE		(ETH_BASE + 0x1000U)
#endif

static struct RCC *const RCC = ((struct RCC *const)RCC_BASE);
static struct SYSCFG *const SYSCFG = ((struct SYSCFG *const) SYSCFG_BASE);
static struct EXTI *const EXTI = ((struct EXTI *const) EXTI_BASE);
static struct PWR *const PWR = ((struct PWR *const) PWR_BASE);
static struct FLASH *const FLASH = ((struct FLASH *const) FLASH_R_BASE);
static struct GPIO *const GPIOA = ((struct GPIO *const) GPIOA_BASE);
static struct GPIO *const GPIOB = ((struct GPIO *const) GPIOB_BASE);
static struct GPIO *const GPIOC = ((struct GPIO *const) GPIOC_BASE);
static struct GPIO *const GPIOD = ((struct GPIO *const) GPIOD_BASE);
static struct GPIO *const GPIOE = ((struct GPIO *const) GPIOE_BASE);
static struct GPIO *const GPIOF = ((struct GPIO *const) GPIOF_BASE);
static struct GPIO *const GPIOG = ((struct GPIO *const) GPIOG_BASE);
static struct TIM *const TIM2 = ((struct TIM *const) TIM2_BASE);
static struct TIM *const TIM3 = ((struct TIM *const) TIM3_BASE);
static struct TIM *const TIM4 = ((struct TIM *const) TIM4_BASE);
static struct TIM *const TIM5 = ((struct TIM *const) TIM5_BASE);
static struct TIM *const TIM6 = ((struct TIM *const) TIM6_BASE);
static struct TIM *const TIM7 = ((struct TIM *const) TIM7_BASE);
static struct USART *const USART1 = ((struct USART *const) USART1_BASE);
static struct USART *const USART2 = ((struct USART *const) USART2_BASE);
static struct USART *const USART3 = ((struct USART *const) USART3_BASE);
static struct USART *const UART4 = ((struct USART *const) UART4_BASE);
static struct USART *const UART5 = ((struct USART *const) UART5_BASE);
static struct USART *const USART6 = ((struct USART *const) USART6_BASE);
static struct CAN *const CAN1 = ((struct CAN *const) CAN1_BASE);
static struct CAN *const CAN2 = ((struct CAN *const) CAN2_BASE);
static struct SPI *const I2S1 = ((struct SPI *const) SPI1_BASE);
static struct SPI *const I2S2 = ((struct SPI *const) SPI2_BASE);
static struct SPI *const I2S3 = ((struct SPI *const) SPI3_BASE);
static struct I2C *const I2C1 = ((struct I2C *const) I2C1_BASE);
static struct I2C *const I2C2 = ((struct I2C *const) I2C2_BASE);
static struct I2C *const I2C3 = ((struct I2C *const) I2C3_BASE);
static struct ADC *const ADC1 = ((struct ADC *const) ADC1_BASE);
static struct ADC *const ADC2 = ((struct ADC *const) ADC2_BASE);
static struct ADC *const ADC3 = ((struct ADC *const) ADC3_BASE);
static struct ADCC *const ADCC = ((struct ADCC *const) ADCC_BASE);
#if 0
static struct ETH *const ETH = ((struct ETH *const) ETH_BASE);
#endif
static struct DMA *const DMA1 = ((struct DMA *const) DMA1_BASE);
static struct DMA *const DMA2 = ((struct DMA *const) DMA2_BASE);
static struct DMA_Stream *const DMA1_Stream __attribute__((unused)) =
  ((struct DMA_Stream *const) (DMA1_BASE + sizeof (struct DMA)));
static struct DMA_Stream *const DMA2_Stream __attribute__((unused)) =
  ((struct DMA_Stream *const) (DMA2_BASE + sizeof (struct DMA)));
